Repository: DevelopCubeLab/TrollSIMSwitcher
Catalog: TrollSIMSwitcherWidget/Localizable.xcstrings
Source language: en
Languages: zh_hans

# RebootCommCenter
source: Restart Cellular Service
zh_hans: 重启蜂窝网络服务

# RebootCommCenterDescription
source: Rebooting the baseband service will reload cellular network components and may help resolve issues such as signal problems, unstable data connections, or failed switching.
zh_hans: 重启基带服务将重新加载蜂窝网络相关组件，可用于解决信号异常、数据连接不稳定或切换失败等问题。

source: Switch Cellular Plan
zh_hans: 切换蜂窝数据卡

source: Switch Data Card
zh_hans: 切换数据流量卡

source: Switch Data Type
zh_hans: 切换数据类型

source: Switch to 4G
zh_hans: 切换至4G

source: Switch to 5G
zh_hans: 切换至5G

source: Switch to Slot 1
zh_hans: 切换至卡1

source: Switch to Slot 2
zh_hans: 切换至卡2

# ToggleCellularNetworkType
source: Toggle Cellular Network Type(e.g. switching between 4G and 5G)
zh_hans: 切换蜂窝网络类型（例如在4G与5G之间切换）

# ToggleCellularPlanStatus
source: Toggle Cellular Plan Status(You need to set the cellular plan that needs to be operated in the App first)
zh_hans: 切换蜂窝数据卡状态（需要先在App内设置需要操作的蜂窝数据卡）

# ToggleSlot
source: Switch to another slot
zh_hans: 切换至另一个卡槽

# TurnOffCellularPlan
source: Turn Off Cellular Plan(You need to set the cellular plan that needs to be operated in the App first)
zh_hans: 关闭蜂窝数据卡（需要先在App内设置需要操作的蜂窝数据卡）

# TurnOnCellularPlan
source: Turn On Cellular Plan(You need to set the cellular plan that needs to be operated in the App first)
zh_hans: 开启蜂窝数据卡（需要先在App内设置需要操作的蜂窝数据卡）
